initialExplanation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>initialExplanation</title>
<!-- 2014-12-08 Mon 07:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Carlo Nucera" />
</head>
<body>
<div id="content">
<h1 class="title">initialExplanation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. The original goal of Music Suite</a></li>
<li><a href="#sec-2">2. The most important types in the library</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The original goal of Music Suite</h2>
<div class="outline-text-2" id="text-1">
<p>
was to generalize music notation.
</p>

<p>
As a trained composer I have been taught how to work not just with
the common notions of pitch and rhythm (c sharp, quarter notes etc),
but also with other systems such as enharmonic 12/tone musical set
theory, quarter tones, other notions of microtonality etc.
</p>

<p>
I was concerned that standard notation systems and software like
Sibelius/Finale was unable to handle this richness of material, and
wanted a system in which various levels of strictness could be
applied to time, pitch and other musical aspects. I then split the
library into 5 musical aspects, namely time, pitch, dynamics,
articulation and parts (instrumentation, timbre etc). The idea is
that the libraries define various types used to represent pitch,
dynamics etc, and that these can be composed by the user. In
practice we often just want to use a standard representation, which
is why the preludes package was created.
</p>

<p>
As you can probably tell, the Music.Time hierarchy contains musical
time structures (similar to containers, but all based on the notion
of placing or orienting values in time), partly inspired by FRP, and
completely separate from the other musical aspects.
</p>

<p>
The goal and main challenge of the library is how to keep the
aspects separate and allow the user to combine them in a useful
way. Because music has so <b>many</b> aspects (at least 5, and others
such as space might also be interesting to add) we might easily run
into types with a lot of parameters.
</p>

<p>
Imagine for example that we had a type called S used to represent a
list of events with onset and offsets, and wanted to parameterize
pitch, dynamics and articulation: That would give us a type
signature on the form "Score StandardPitch Hertz ()" etc, which I
think is to obtrusive, especially as this type will turn up quite
often (compare ParsecT in parsec).
</p>

<p>
The solution I adopted was to treat time structures as parametric
types of kind <code>(* -&gt; *)</code> and use type functions to access the
aspects. Thus we can get away with only one parameter, and use
constructions such as 
</p>
<pre class="example">
showScorePithes :: Show (Pitch a) =&gt; Score a -&gt; [String]
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The most important types in the library</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt> Music.Pitch.Common.Pitch </dt><dd>Western pitch, distinguishes between f# and gb etc.
</dd>
<dt> Music.Pitch.Common.Interval </dt><dd>Western intervals, distinguishes d5 and A4 etc.
</dd>
<dt> Music.Parts.Part </dt><dd>Represents a musical part, i.e. an instrument and optional subdivision (Violin I.2, Flute I, Solo Horn etc.)
</dd>
<dt> Music.Dynamics.Dynamic </dt><dd>Represents a single dynamic level
</dd>
<dt> Music.Articulation.Articulation </dt><dd>Represents a single musical articulation
</dd>
<dt> Music.Time.Time </dt><dd>Represents a point in time
</dd>
<dt> Music.Time.Duration </dt><dd>Represents the distance between two points in time (a vector in time)
</dd>
<dt> Music.Time.Span </dt><dd>Represents two points in time (the span of a musical note for example)
</dd>
<dt> Music.Time.Note </dt><dd>A value with an attached duration
</dd>
<dt> Music.Time.Event </dt><dd>A value with an attached span
</dd>
<dt> Music.Time.Voice </dt><dd>A sequential composition of notes
</dd>
<dt> Music.Time.Score </dt><dd>A parallel composition of events
</dd>
<dt> Music.Time.Behavior </dt><dd>A continously time-varying value (same as in FRP)
</dd>
<dt> Music.Time.Reactive </dt><dd>A discretely time-varying value (same as in FRP)
</dd>
</dl>

<p>
The many similarly named constructions for things such as Pitches and Interval is a consequence of this, as we need to distinguish:
</p>
<ul class="org-ul">
<li>Pitch as commonly defined in Common Practice Western Music (Interval and Pitch in Music.Pitch.Common)
</li>
<li>The names c, d, e, f, g etc (IsInterval and IsPitch)
</li>
<li>The associated pitch type of another type (Music.Score.Pitch). For example if you build up a parallel collection of voices of common pitches, their pitch type is common pitch. This is what allows you to use functions such as _8va on single notes as well as on scores.
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Carlo Nucera</p>
<p class="date">Created: 2014-12-08 Mon 07:43</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
